drowe67/codec2-dev/stm32/src/sm1000_main.c
                for (i = 0; i < dac_rem; i++)
                    dac16k[i] = tone_next(&tone_gen);
                dac2_write(dac16k, dac_rem, 0);
            }
            if (!menuLEDTicker) {
                menuLEDTicker = MENU_LED_PERIOD;
                led_rt(LED_INV);
            }
        }

        /* Button released, do an EEPROM erase */
        for (i = 0; i < PREFS_IMG_NUM; i++)
            vrom_erase(i + PREFS_IMG_BASE);
    }
    led_rt(LED_OFF);
    tone_reset(&tone_gen, 0, 0);
    tot_reset(&tot);

    usart_printf("loading preferences from flash....\n");

    /* Try to load preferences from flash */
    if (load_prefs() < 0) {
        /* Fail!  Load defaults. */
        memset(&prefs, 0, sizeof(prefs));
        prefs.op_mode = ANALOG;
        prefs.menu_vol = 2;
        prefs.menu_speed = 60;  /* 20 WPM */
        prefs.menu_freq = 800;
        prefs.tot_period = 0; /* Disable time-out timer */
        prefs.tot_warn_period = 15;
    }

    /* Set up time-out timer, 100msec ticks */
    tot.tick_period        = 100;
    tot.remain_warn_ticks  = 10;

    /* Clear out switch states */
    memset(&sw_select, 0, sizeof(sw_select));
    memset(&sw_back, 0, sizeof(sw_back));
    memset(&sw_ptt, 0, sizeof(sw_ptt));

    /* Clear out menu state */
    memset(&menu, 0, sizeof(menu));

    morse_player.freq = prefs.menu_freq;
    morse_player.dit_time = prefs.menu_speed;
    morse_player.msg = NULL;
    op_mode = prefs.op_mode;

    /* play a start-up tune. */
    morse_play(&morse_player, VERSION);
    //sfx_play(&sfx_player, sound_startup);

    usart_printf("entering main loop...\n");

    uint32_t lastms = ms;
    n_samples = FORTY_MS_16K/4;
    n_samples_16k = 2*n_samples;
   
    while(1) {
        /* Read switch states */
        switch_update(&sw_select,   (!switch_select()) ? 1 : 0);
        switch_update(&sw_back,     (!switch_back()) ? 1 : 0);
        switch_update(&sw_ptt,      (switch_ptt() || (!ext_ptt())) ? 1 : 0);

        /* Update time-out timer state */
        tot_update(&tot);

        /* iterate core state machine based on switch events */
        int prev_op_mode = op_mode;
        int prev_core_state = core_state;
        core_state = process_core_state_machine(core_state, &menu, &op_mode);

        /* Acknowledge switch events */
        switch_ack(&sw_select);
        switch_ack(&sw_back);
        switch_ack(&sw_ptt);

        /* if mode has changed, re-open freedv */
        if (op_mode != prev_op_mode) {
            usart_printf("Mode change prev_op_mode: %d op_mode: %d\n", prev_op_mode, op_mode);
            if (f) freedv_close(f); f = NULL;
            switch(op_mode) {
            case ANALOG:
                usart_printf("Analog\n");
                n_samples = FORTY_MS_16K/4;
                break;
            case DV1600:
                usart_printf("FreeDV 1600\n");
                f = freedv_open(FREEDV_MODE_1600);
                assert(f != NULL);
                n_samples = freedv_get_n_speech_samples(f);
                break;
            case DV700D:
                usart_printf("FreeDV 700D\n");
                f = freedv_open(FREEDV_MODE_700D);
                assert(f != NULL);
                n_samples = freedv_get_n_speech_samples(f);
                break;
            }
            n_samples_16k = 2*n_samples;
            usart_printf("FreeDV f = 0x%x n_samples: %d n_samples_16k: %d\n", (int)f, n_samples, n_samples_16k);

            /* clear buffers */

            for(i=0; i<FDMDV_OS_TAPS_16K+n_samples_16k; i++)
                adc16k[i] = 0; 
            for(i=0; i<n_samples_16k; i++)
                dac16k[i] = 0; 
            for(i=0; i<n_samples; i++)
                adc8k[i] = 0;
            for(i=0; i<FDMDV_OS_TAPS_8K+n_samples; i++)
                dac8k[i] = 0; 
        }

        /* if we have moved from tx to rx reset sync state of rx so we re-start acquisition */
        if ((op_mode == DV1600) || (op_mode == DV700D))
            if ((prev_core_state == STATE_TX) && (core_state == STATE_RX))
                freedv_set_sync(f, FREEDV_SYNC_UNSYNC);
            
        /* perform signal processing based on core state */
        switch (core_state) {
            case STATE_MENU:
                if (!menuLEDTicker) {
                    led_pwr(LED_INV);
                    menuLEDTicker = MENU_LED_PERIOD;
                }
                break;
            case STATE_TX:
            /* Transmit -------------------------------------------------------------------------*/

                /* ADC2 is the SM1000 microphone, DAC1 is the modulator signal we send to radio tx */

                if (adc2_read(&adc16k[FDMDV_OS_TAPS_16K], n_samples_16k) == 0) {
                    GPIOE->ODR = (1 << 3);

                    /* clipping indicator */

                    led_err(0);
                    for (i=0; i<n_samples_16k; i++) {
                        if (abs(adc16k[FDMDV_OS_TAPS_16K+i]) > 28000)
                            led_err(1);
                    }

                    fdmdv_16_to_8_short(adc8k, &adc16k[FDMDV_OS_TAPS_16K], n_samples);

                    if (op_mode == ANALOG) {
                        for(i=0; i<n_samples; i++)
                            dac8k[FDMDV_OS_TAPS_8K+i] = adc8k[i];
                        fdmdv_8_to_16_short(dac16k, &dac8k[FDMDV_OS_TAPS_8K], n_samples);
                        dac1_write(dac16k, n_samples_16k, 0);
                    }
                    else {
                        freedv_tx(f, &dac8k[FDMDV_OS_TAPS_8K], adc8k);
                        for(i=0; i<n_samples; i++)
                            dac8k[FDMDV_OS_TAPS_8K+i] *= 0.398; /* 8dB back off from peak */
                        fdmdv_8_to_16_short(dac16k, &dac8k[FDMDV_OS_TAPS_8K], n_samples);
                        dac1_write(dac16k, n_samples_16k, 0);
                    }

                    led_ptt(1); led_rt(0); led_err(0); not_cptt(0);
                    GPIOE->ODR &= ~(1 << 3);
                }
                break;

            case STATE_RX:
            case STATE_RX_TOT:
                /* Receive --------------------------------------------------------------------------*/

