drowe67/codec2-dev/stm32/src/sm1000_main.c
                not_cptt(1);
                led_ptt(0);

                /* ADC1 is the demod in signal from the radio rx, DAC2 is the SM1000 speaker */

                if (op_mode == ANALOG) {
                    if (ms > lastms+5000) {
                        usart_printf("Analog\n");
                        lastms = ms;
                    }

                    if (adc1_read(&adc16k[FDMDV_OS_TAPS_16K], n_samples_16k) == 0) {
                        fdmdv_16_to_8_short(adc8k, &adc16k[FDMDV_OS_TAPS_16K], n_samples);
                        for(i=0; i<n_samples; i++)
                            dac8k[FDMDV_OS_TAPS_8K+i] = adc8k[i];
                        fdmdv_8_to_16_short(dac16k, &dac8k[FDMDV_OS_TAPS_8K], n_samples);
                        spk_nsamples = n_samples_16k;
                        led_rt(0); led_err(0);
                   }
                }
                else {
                    if (ms > lastms+5000) {
                        usart_printf("Digital Voice\n");
                        lastms = ms;
                    }
                    
                    /* 1600 or 700D DV mode */

                    nin = freedv_nin(f);
                    nout = nin;
                    freedv_set_total_bit_errors(f, 0);
                    if (adc1_read(&adc16k[FDMDV_OS_TAPS_16K], 2*nin) == 0) {
                        GPIOE->ODR = (1 << 3);
                        fdmdv_16_to_8_short(adc8k, &adc16k[FDMDV_OS_TAPS_16K], nin);
                        nout = freedv_rx(f, &dac8k[FDMDV_OS_TAPS_8K], adc8k);
                        fdmdv_8_to_16_short(dac16k, &dac8k[FDMDV_OS_TAPS_8K], nout);
                        spk_nsamples = 2*nout;
                        led_rt(freedv_get_sync(f)); led_err(freedv_get_total_bit_errors(f));
                        GPIOE->ODR &= ~(1 << 3);
                    }
                }
                break;
            default:
                break;
        }

        /* Write audio to speaker output */
        if (spk_nsamples || sfx_player.note || morse_player.msg) {
            /* Make a note of our playback position */
            int16_t* play_ptr = dac16k;

            if (!spk_nsamples)
                spk_nsamples = dac2_free();

            /*
             * There is audio to play on the external speaker.  If there
             * is a sound or announcement, software-mix it into the outgoing
             * buffer.
             */
            if (sfx_player.note) {
                int i;
                if (menu.stack_depth) {
                    /* Exclusive */
                    for (i = 0; i < spk_nsamples; i++)
                        dac16k[i] = sfx_next(&sfx_player) >> prefs.menu_vol;
                } else {
                    /* Software mix */
                    for (i = 0; i < spk_nsamples; i++)
                        dac16k[i] = software_mix(dac16k[i],
                                sfx_next(&sfx_player) >> prefs.menu_vol);
                }
                if (!sfx_player.note && morse_player.msg)
                    announceTicker = ANNOUNCE_DELAY;
            } else if (!announceTicker && morse_player.msg) {
                int i;
                if (menu.stack_depth) {
                    for (i = 0; i < spk_nsamples; i++)
                        dac16k[i] = morse_next(&morse_player) >> prefs.menu_vol;
                } else {
                    for (i = 0; i < spk_nsamples; i++)
                        dac16k[i] = software_mix(dac16k[i],
                                morse_next(&morse_player) >> prefs.menu_vol);
                }
            }

            while (spk_nsamples) {
                /* Get the number of samples to be played this time around */
                int n_rem = dac2_free();
                if (spk_nsamples < n_rem)
                    n_rem = spk_nsamples;
                /* Play the audio */
                dac2_write(play_ptr, n_rem, 0);
                spk_nsamples -= n_rem;
                play_ptr += n_rem;
            }

            /* Clear out buffer */
            memset(dac16k, 0, n_samples_16k*sizeof(short));
        }

    } /* while(1) ... */
}

/*
 * SysTick Interrupt Handler
 */

void SysTick_Handler(void)
{
    ms++;
    switch_tick(&sw_select);
    switch_tick(&sw_back);
    switch_tick(&sw_ptt);
    if (menuTicker > 0) {
        menuTicker--;
    }
    if (menuLEDTicker > 0) {
        menuLEDTicker--;
    }
    if (announceTicker > 0) {
        announceTicker--;
    }
    tot_tick(&tot);
}


int process_core_state_machine(int core_state, struct menu_t *menu, int *op_mode) {
    /* State machine updates */
    switch(core_state) {
    case STATE_RX:
        {
            uint8_t mode_changed = 0;

            if (!menuTicker) {
                if (menuExit) {
                    /* We've just exited a menu, wait for release of BACK */
                    if (switch_released(&sw_back))
                        menuExit = 0;
                } else if (switch_pressed(&sw_ptt)) {
                    /* Cancel any announcement if scheduled */
                    if (announceTicker && morse_player.msg) {
                        announceTicker = 0;
                        morse_play(&morse_player, NULL);
                    }
                    /* Start time-out timer if enabled */
                    if (prefs.tot_period)
                        tot_start(&tot, prefs.tot_period*10,
                                  prefs.tot_warn_period*10);
                    /* Enter transmit state */
                    core_state = STATE_TX;
                } else if (switch_pressed(&sw_select) > HOLD_DELAY) {
                    /* Enter the menu */
                    led_pwr(1); led_ptt(0); led_rt(0);
                    led_err(0); not_cptt(1);

                    menu_enter(menu, &menu_root);
                    menuTicker = MENU_DELAY;
                    core_state = STATE_MENU;
                    prefs_changed = 0;
                } else if (switch_released(&sw_select)) {
                    /* Shortcut: change current mode */
                    *op_mode = (*op_mode + 1) % MAX_MODES;
                    mode_changed = 1;
                } else if (switch_released(&sw_back)) {
                    /* Shortcut: change current mode */
                    *op_mode = (*op_mode - 1) % MAX_MODES;
                    mode_changed = 1;
                }

                if (mode_changed) {
                    /* Announce the new mode */
                    if (*op_mode == ANALOG)
                        morse_play(&morse_player, "ANA");
                    else if (*op_mode == DV1600)
                        morse_play(&morse_player, "1600");
                    else if (*op_mode == DV700D)
                        morse_play(&morse_player, "700D");
                    sfx_play(&sfx_player, sound_click);
                }
            }
        }
        break;
    case STATE_TX:
        {
            if (!switch_pressed(&sw_ptt)) {
                /* PTT released, leave transmit mode */
                tot_reset(&tot);
                core_state = STATE_RX;
            } else if (tot.event & TOT_EVT_TIMEOUT) {
                /* Time-out reached */
                sfx_play(&sfx_player, sound_death_march);
                tot.event &= ~TOT_EVT_TIMEOUT;
                core_state = STATE_RX_TOT;
            } else if (tot.event & TOT_EVT_WARN_NEXT) {
                /* Re-set warning flag */
                tot.event &= ~TOT_EVT_WARN_NEXT;
                /* Schedule a click tone */
                sfx_play(&sfx_player, sound_click);
            }
        }
        break;
    case STATE_RX_TOT:
        if (switch_released(&sw_ptt)) {
            /* PTT released, leave transmit mode */
            tot_reset(&tot);
            core_state = STATE_RX;
        }
        break;
    case STATE_MENU:
        if (!menuTicker) {
            /* We are in a menu */
            static uint8_t press_ack = 0;
            uint8_t save_settings = 0;

            if (press_ack == 1) {
                if ((sw_select.state == SW_STEADY)
                    && (!sw_select.sw))
                    press_ack = 0;
            } else if (press_ack == 2) {
                if ((sw_back.state == SW_STEADY)
                    && (!sw_back.sw))
                    press_ack = 0;
            } else {
                if (switch_pressed(&sw_select) > HOLD_DELAY) {
                    menu_exec(menu, MENU_EVT_SELECT);
                    press_ack = 1;
                    menuTicker = MENU_DELAY;
                } else if (switch_pressed(&sw_back) > HOLD_DELAY) {
                    menu_exec(menu, MENU_EVT_BACK);
                    press_ack = 2;
                    menuTicker = MENU_DELAY;

                    if (!menu->stack_depth)
                        save_settings = prefs_changed;

                } else if (switch_released(&sw_select)) {
                    menu_exec(menu, MENU_EVT_NEXT);
                    menuTicker = MENU_DELAY;
                } else if (switch_released(&sw_back)) {
                    menu_exec(menu, MENU_EVT_PREV);
                    menuTicker = MENU_DELAY;
                } else if (switch_released(&sw_ptt)) {
                    while(menu->stack_depth > 0)
                        menu_exec(menu, MENU_EVT_EXIT);
                    sfx_play(&sfx_player, sound_returned);
                }

                /* If exited, put the LED back */
                if (!menu->stack_depth) {
                    menuLEDTicker = 0;
                    menuTicker = 0;
                    led_pwr(LED_ON);
                    morse_play(&morse_player, NULL);
                    menuExit = 1;
                    if (save_settings) {
                        int oldest = -1;
                        int res;
                        /* Copy the settings in */
                        prefs.menu_freq = morse_player.freq;
                        prefs.menu_speed = morse_player.dit_time;
                        /* Increment serial number */
                        prefs.serial++;
                        /* Find the oldest image */
                        find_prefs(&oldest, NULL);
                        if (oldest < 0)
                            oldest = 0; /* No current image */

                        /* Write new settings over it */
                        res = vrom_write(oldest + PREFS_IMG_BASE, 0,
                                         sizeof(prefs), &prefs);
                        if (res >= 0)
                            prefs_serial[oldest] = prefs.serial;
                    }
                    /* Go back to receive state */
                    core_state = STATE_RX;
                }
            }
        }
        break;
    default:
        break;
    }

    return core_state;
}


/* ---------------------------- Menu data ---------------------------
 *
 * MENU -
 * 	|- "MODE"       Select operating mode
 * 	|   |- "ANA"    - Analog
 * 	|   |- "DV1600" - FreeDV 1600 
 * 	|   |- "DV700D" - FreeDV 700D
 *      |
 * 	|- "TOT"        Timer Out Timer options
 * 	|   |- "TIME"   - Set timeout time (a sub menu)
 * 	|   |   |-        - SELECT.PRESS add 5 sec
 * 	|   |   |-        - BACK.PRESS subtracts 5 sec
 *      |   |
 * 	|   |- "WARN"   - Set warning time (a sub menu)
 * 	|   |   |-        - SELECT.PRESS add 5 sec
 * 	|   |   |-        - BACK.PRESS subtracts 5 sec
 *      | 
 * 	|- "UI"         UI (morse code announcments) parameters
 * 	|   |- "FREQ"   - Set tone
 * 	|   |   |-        - SELECT.PRESS add 50 Hz
 * 	|   |   |-        - BACK.PRESS subtracts 50 Hz
 *      |   |
 * 	|   |- "WPMQ"   - Set speed
 * 	|   |   |-        - SELECT.PRESS add 5 WPM
 * 	|   |   |-        - BACK.PRESS subtracts 5 WPM
 *      |   |
 * 	|   |- "VOL"    - Set volume
 * 	|   |   |-        - SELECT.PRESS -> quieter
 * 	|   |   |-        - BACK.PRESS -> louder
 */

/*!
 * Default handler for menu callback.
 */
static void menu_default_cb(struct menu_t* const menu, uint32_t event)
{
    /* Get the current menu item */
    const struct menu_item_t* item = menu_item(menu, 0);
    uint8_t announce = 0;

    switch(event) {
        case MENU_EVT_ENTERED:
            sfx_play(&sfx_player, sound_startup);
            /* Choose first item */
            menu->current = 0;
        case MENU_EVT_RETURNED:
            announce = 1;
            break;
        case MENU_EVT_NEXT:
            sfx_play(&sfx_player, sound_click);
            menu->current = (menu->current + 1) % item->num_children;
            announce = 1;
            break;
        case MENU_EVT_PREV:
            sfx_play(&sfx_player, sound_click);
            menu->current = (menu->current - 1) % item->num_children;
            announce = 1;
            break;
        case MENU_EVT_SELECT:
            /* Enter the sub-menu */
            menu_enter(menu, item->children[menu->current]);
            break;
        case MENU_EVT_BACK:
            /* Exit the menu */
            sfx_play(&sfx_player, sound_returned);
        case MENU_EVT_EXIT:
            menu_leave(menu);
            break;
        default:
            break;
    }

    if (announce) {
        /* Announce the label of the selected child */
        morse_play(&morse_player,
                item->children[menu->current]->label);
    }
}

/* Root menu item forward declarations */
static const struct menu_item_t* menu_root_children[];
/* Root item definition */
static const struct menu_item_t menu_root = {
    .label          = "MENU",
    .event_cb       = menu_default_cb,
    .children       = menu_root_children,
    .num_children   = 2,
};

/* Child declarations */
static const struct menu_item_t menu_op_mode;
static const struct menu_item_t menu_tot;
static const struct menu_item_t menu_ui;
static const struct menu_item_t * menu_root_children[] = {
    &menu_op_mode,
    &menu_tot,
    &menu_ui,
};


/* Operation Mode menu forward declarations */
static void menu_op_mode_cb(struct menu_t* const menu, uint32_t event);
static struct menu_item_t const* menu_op_mode_children[];
/* Operation mode menu */
static const struct menu_item_t menu_op_mode = {
    .label          = "MODE",
    .event_cb       = menu_op_mode_cb,
    .children       = menu_op_mode_children,
    .num_children   = 3,
};
/* Children */
static const struct menu_item_t menu_op_mode_analog = {
    .label          = "ANA",
    .event_cb       = NULL,
    .children       = NULL,
    .num_children   = 0,
    .data           = {
        .ui         = ANALOG,
    },
};
static const struct menu_item_t menu_op_mode_dv1600 = {
    .label          = "1600",
    .event_cb       = NULL,
    .children       = NULL,
    .num_children   = 0,
    .data           = {
        .ui         = DV1600,
    },
};
static const struct menu_item_t menu_op_mode_dv700D = {
    .label          = "700D",
    .event_cb       = NULL,
    .children       = NULL,
    .num_children   = 0,
    .data           = {
        .ui         = DV700D,
    },
};
static struct menu_item_t const* menu_op_mode_children[] = {
    &menu_op_mode_analog,
    &menu_op_mode_dv1600,
    &menu_op_mode_dv700D,
};
